package 개발자괴롭히기;

import java.sql.Connection;

import java.sql.DriverManager;
import java.sql.PreparedStatement;
import java.sql.SQLException;
import java.util.ArrayList;
import java.util.Random;
import java.util.Scanner;

import oracle.net.aso.s;

public class DeveloperMainSystem {

	public static void main(String[] args) {

		// MVC Pattern (Design Pattern 일종 )
		// Model View Controller
		// Model : 데이터를 묶고 데이터베이스에 접근하는 역할(DAO)
		// View : Client 화면에 보여주고 안내하고 입력받는 역할(Main System)
		// Controller : View 와 Model 을 이어주는 역할, 조종역할

		Scanner sc = new Scanner(System.in);
		DeveloperController controller = new DeveloperController();
		// 모든 기능에서 사용할 수 있도록 전역변수 dto, dao 생성

		DeveloperDTO dto = null;
		CharacterDTO player = null;
		CharacterDTO enemy = null;

		while (true) {
			// CRUD (create / read / update / delete)	
			System.out.print("\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣶⡄⠀⠀⠀⣠⣤⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣶⣤⡀⠀⠀⠀⠀⠈⢻⣿⡆⠀⢸⣿⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠈⢿⣄⣿⣿⣿⣿⡿⠇⠀⠀⠀⠀⠀⠀⢠⣾⣿⣟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⡗⠀⠀⠀⠀⠀⠀⠀⠀⢰⣦⣤⣀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣾⣿⣷⡆⠀⠀⠀⠀⠀⢠⣾⣿⣿⡿⠿⠋⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠠⢸⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⡟⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⡀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣯⠀⠀⠀⠀⢀⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠈⠀⢸⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣭⡀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⣿⡇⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⣿⣿⣿⠟⠋⠛⠋⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⡇⠀⠀⠀⡀⠁⠀⠀⢸⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⣶⣆⢸⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⡇⠀⠀\r\n"
					+ "⠀⠀⠀⠂⠠⠀⠀⠀⠀⠀⢀⣠⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣅⡀⠀⠁⠀⠀⠀⠀⢸⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⣿⣿⣼⣿⣿⣿⣿⣿⣿⣿⣀⣀⡀⢀⠀⠀⠀⠈⠛⣿⣷⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⡿⣿⣄⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⢿⣧⠀⠀⠀⠀⠀⠠⣿⣿⣿⣿⡇⠘⠛⢷⣄⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⠹⠿⣿⣿⣿⣿⣷⣿⣶⣿⣿⣿⣿⣶⣆\r\n"
					+ "⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⡿⠁⠘⢿⣆⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣯⠈⢻⣧⡀⠀⠀⠀⠀⢿⣿⣿⣿⣧⠀⠀⠀⠉⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⠀⠀⠉⠉⠉⠉⠉⠉⠉⢹⣿⣿⣿⡋⠉\r\n"
					+ "⠀⠀⢀⣰⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣯⠈⠉⣿⣿⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣇⠀⠀⢠⣿⠄⠀⠀⠀⠀⠀⠀⣻⣿⣿⣿⣿⡇⠀⠹⡷⠀⠀⠀⠀⢸⣿⣿⣿⣿⣦⠀⠀⠀⠀⠀⣼⣿⢿⣿⣿⣿⣿⣿⣦⣦⣦⣤⣄⡀⠀⠀⠀⢸⣿⣿⣿⡅⠀\r\n"
					+ "⠀⢠⣾⣿⣿⣿⣿⣿⡿⢿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣦⠀⠙⠋⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⡿⣿⣿⡆⠀⠀⠀⠀⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⢸⣿⣿⣿⠆⠀\r\n"
					+ "⠀⢸⣿⣿⣿⣿⣿⣏⠀⠀⢻⣿⣿⣿⣷⣤⡀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⠄⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⠛⢿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⣨⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⣼⣿⡟⠀⢻⣿⣷⠀⠀⠀⠀⣿⣿⡿⠿⣿⣿⣿⡿⠿⢿⠿⣿⣿⣿⠀⠀⠀⢸⣿⣿⣿⠃⠀\r\n"
					+ "⠀⠀⠹⣿⣿⣿⣿⣿⣆⠀⠈⠹⣿⣿⣿⢿⣿⣦⡀⠀⠀⢠⣾⣿⡟⣽⣿⣿⠀⠀⠀⠀⠀⠀⠀⢠⣴⣿⣿⠟⠀⢈⣿⣿⠃⠀⠀⠀⠀⠀⠀⣰⣿⣿⡿⢿⣿⣿⠃⠀⠀⠀⠀⠀⠀⣼⣿⡿⠃⠀⢸⣿⣿⠀⠀⠀⠀⠀⠈⠀⠈⠉⣿⣿⡇⠀⠀⢸⣿⣿⡷⠀⠀⠀⢸⣿⣿⣿⡁⠀\r\n"
					+ "⠀⣠⣾⣿⡿⠋⢹⣿⣿⠀⠀⠀⠈⠻⣿⣆⠘⣿⣿⠀⠀⣼⣿⡟⠀⢻⣿⣿⠀⠀⠀⠀⠀⠀⠀⣾⣿⠟⠁⠀⠀⠠⣿⣿⡇⠀⠀⠀⠀⠀⣰⣿⡿⠋⠀⢸⣿⣿⠁⠀⠀⠀⠀⠀⢠⣿⡿⠁⠀⠀⠀⢿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⠃⠀⠀⢸⣿⣿⡷⠀⠀⠀⢸⣿⣿⣿⠄⠀\r\n"
					+ "⢾⣿⡿⠋⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⢹⣿⡄⠀⠀⠀⠀⣿⣿⠀⠀⢈⣿⣷⠀⠀⠀⠀⠀⠀⣸⣿⠃⠀⠀⠀⠀⠀⠹⣿⣇⠀⠀⠀⠀⢾⣿⣏⠀⠀⠀⠀⣿⣟⠀⠀⠀⠀⠀⠀⣸⣿⠃⠀⠀⠀⠀⠘⣿⣇⠀⠀⡀⢀⣠⣤⣴⣶⣾⣿⣶⣦⣤⣼⣿⣿⣷⡀⠀⠀⢸⣿⣿⣿⠂⠀\r\n"
					+ "⠈⠻⢿⡄⠀⠀⣾⣿⣿⣦⡄⠀⠀⠀⢿⣿⡇⠀⠀⠀⠸⠿⠿⠷⣶⠤⣿⣿⣷⣤⣤⠀⠀⠀⠛⠻⣷⣄⠀⠀⠀⠀⠀⢹⣿⣿⣶⣤⠀⠀⠹⢿⣦⠄⠀⢠⣿⣿⣶⣦⠄⠀⠀⠰⠿⣿⣷⣤⠀⠀⠀⠀⠸⣿⠿⠟⠃⠸⠿⢯⣿⡍⠀⠈⠉⣿⣯⠻⠿⠿⠿⠿⠷⠤⣼⣿⣿⣿⡅⠀\r\n");
			System.out.println("\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣶⣶⣶⣶⣶⣆⠈⢻⣿⣶⠀⣿⣿⡅⠀⢀⡀⣀⠀⢰⣶⣶⣶⠀⠀⠀⣼⣿⡇⠀⠀⠀⠀⠐⣶⣶⣶⣶⣶⣶⡆⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⢘⠛⡛⢛⠛⡛⢛⠛⡛⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⣿⡧⠀⢰⣿⣿⠀⣿⣿⠆⠀⠙⢻⣿⣿⣤⣴⣿⣿⠀⠀⠀⢾⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠘⢻⣿⣿⠛⠛⠛⠛⠛⠛⠛⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⡿⠓⠀⢨⣿⣿⣤⣿⣿⡃⠀⠀⢸⣿⣯⠀⢈⣿⣿⠀⠀⠀⣻⣿⡿⠿⠻⠟⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⢸⣿⣿⣤⣤⣤⡄⠀⠀⠀⠸⠟⠿⠻⠟⠿⠟⠿⠟⠿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣾⡿⠇⠀⠀⢘⣿⣿⠉⣿⣿⡅⠀⠀⠸⠿⠿⠿⠾⠿⠿⠀⠀⠀⣽⣿⡇⠀⠀⠀⠀⠀⠀⣿⠿⠋⣵⣇⡀⠀⠀⢸⣿⣿⠉⠉⠉⠀⠀⠸⠿⠷⠿⠾⠷⠿⠾⠿⠾⠿⠾⠿⠿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡶⢿⠏⠁⠀⠀⠀⠸⣿⣿⠀⣿⣿⠆⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣀⣾⣏⡁⠀⠀⠀⢀⣐⠶⠉⠁⠀⠉⣽⡇⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠰⣶⢶⡶⣶⢶⡶⣶⣶⣶⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⣿⣿⡃⠀⠀⠀⠀⠘⠛⠛⠛⠛⠛⠛⠛⣻⣿⡇⠀⠀⠀⠈⠛⠀⠀⠀⠀⠀⠘⠃⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⢰⣶⣶⣶⣶⣶⣶⣦⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⠛⠀⣿⣿⠅⠀⠀⠀⠀⠘⢻⣿⣿⠛⠛⠛⠛⠛⠛⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠁⠀⠀⠀⠀⠀⠀⠀⠈⠟⠻⠻⠛⠿⠛⠟⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠻⠛⠟⠻⠟⠻⠛⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣰⣶⠶⠶⣶⣂⡀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠶⠶⠶⠶⣶⣶⡶⠀⠀⠀⠀⣿⣿⡇⠀⠀⠰⠶⠶⠶⠶⢶⣶⣶⡆⠀⠀⣹⣿⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣾⣿⠉⠀⠀⠋⣿⣷⡆⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣟⠰⣶⣶⣶⣿⣿⡇⠀⠀⢀⣀⣀⣀⣀⣠⣿⣿⠆⠀⠀⢼⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⡀⣿⣿⡇⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⢴⣾⡟⠋⠀⡀⢀⠀⣿⣿⡇⠀⠀⠘⢻⣿⣿⠛⠛⠛⠛⠁⠀⠀⢺⣿⣷⣴⣤⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢻⣿⣤⣦⣿⠟⠃⠀⠀⠀⢸⣿⣿⠀⠀⠀ ⠀⠀⣴⣾⡟⠋⠀⠘⠛⠛⠟⣿⣿⡇⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⣴⡄⢹⣿⣯⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠉⠈⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⣤⡛⠿⠃⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠈⠙⠿⠻⠟⠿⠻⠟⠂⠀⣹⣿⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢼⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⣿⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
					+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n");

			System.out.println("===================== 1.회원등록====================");
			System.out.println("===================== 2.로그인=====================");
			System.out.println("===================== 3.회원탈퇴=====================");
			System.out.print(" >>> ");
			int menu = sc.nextInt();

			if (menu == 1) {
				System.out.println("\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣤⣶⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⠿⠛⠋⠉⠉⠉⠉⠉⠉⠙⠛⠿⣿⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⡷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⡿⠃⠀⠀⠀⠀⠀⠀⢀⡀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡟⠀⠀⠀⠀⢀⣤⣶⣾⣿⣿⣿⣿⣿⣿⣷⣦⣄⡀⠀⠀⠀⠀⢰⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⡿⠀⠀⠀⢀⣴⣿⣿⠟⠋⠉⠀⠀⠀⠀⠉⠛⠿⣿⣿⣦⠀⠀⠀⠀⢿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⢠⣾⣿⠟⠁⠀⣠⣴⣶⣶⣶⣶⣦⣀⠀⠈⢻⣿⣷⡄⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡅⠀⠀⣾⣿⡏⠀⢀⣼⣿⡿⠛⠋⠛⠛⢿⣿⣧⡀⠀⢹⣿⣷⠀⠀⢘⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣀⣿⣿⠆⠀⢰⣿⣿⠀⠀⣸⣿⡿⠀⠀⠀⠀⠀⠀⢿⣿⣇⠀⠀⣿⣿⡆⠀⢨⣿⣿⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣾⣿⣿⠿⣿⣿⡃⠀⠘⣿⣿⣦⣤⣿⣿⠇⠀⠀⠀⠀⠀⠀⣾⣿⡇⠀⢀⣿⣿⠇⠀⠰⣿⣿⠿⣿⣿⣷⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⡿⠉⠀⠀⣿⣿⡅⠀⠀⠈⠛⠿⠿⠟⠋⠀⠀⣀⣀⣀⣴⣾⣿⡟⠁⠀⣸⣿⡿⠀⠀⢘⣿⣿⠀⠀⠉⢿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⣿⣿⠆⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⠿⠿⠟⠉⠀⢀⣼⣿⡿⠃⠀⠀⢨⣿⣿⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣷⣀⠀⠀⣿⣿⡃⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⣀⣠⣶⣿⣿⠟⠁⠀⠀⠀⠰⣿⣿⠀⠀⣀⣾⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⢿⣿⣿⣶⣿⣿⡅⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⣾⣿⡿⠟⠋⠁⠀⠀⠀⠀⠀⢘⣿⣿⣷⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣦⣴⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⢨⣿⣿⠉⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢠⣾⣿⠿⠿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣀⣠⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⣠⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⠿⠋⠀⠀⠀⠀⠀⠀⣠⣾⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣾⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣿⣿⣿⣿⣷⣶⣶⣶⣶⣶⣶⣿⣿⣿⣿⣿⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿⣿⠄⠉⠙⠛⠛⠛⠛⠛⠛⠋⠉⠠⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣴⣶⣶⣾⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⣿⣿⣷⣶⣶⣤⣤⣄⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣶⣿⣿⣿⣿⠀⠀⠈⠻⠟⠛⠛⠋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠛⠛⠛⠻⠿⢿⣿⣿⣿⣿⣿⣷⣶⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⣿⣿⠿⠛⠋⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠙⠛⠿⣿⣿⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⡿⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣿⣧⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣾⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣷⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⢀⣤⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣤⡀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⠟⠀⠀⠀⠀⠀⠀⠀⠘⣿⡿⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣤⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⠀⠀⠀⠀⠀⠀⠀\r\n"
						+ "⠀⠀⠀⠀⠀⠀⠀⢿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⡿⠀⠀⠀⠀⠀⠀⠀\r\n" + "");
				System.out.println("======회원등록=====");
				System.out.print("ID입력 : ");
				String id = sc.next();
				System.out.print("PW입력 : ");
				String pw = sc.next();

				dto = new DeveloperDTO(id, pw);
				int cnt = controller.join(dto);

				if (cnt > 0) {
					System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⢄⢆⢆⢇⢇⢇⢇⢇⢖⢔⢄⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + "⠀⠀⠀⠀⠀⢀⢠⢢⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⢣⠣⡄⡀⠀⠀⠀⠀⠀\r\n"
							+ "⠀⠀⠀⢀⢰⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⢸⠸⡸⡸⡘⡜⡜⡜⡜⡜⡄⡀⠀⠀⠀\r\n" + "⠀⠀⢀⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢲⢩⢪⢪⢪⢪⢪⢪⢪⢪⢪⢒⠄⠀⠀\r\n"
							+ "⠀⢠⢣⢣⢣⢣⢣⢣⢣⢣⢣⠣⡣⡣⡱⡱⡱⡱⡱⡱⡱⡱⡱⠑⡱⡱⡱⡱⢍⠆⠀\r\n" + "⠠⡱⡱⡱⡱⡱⡑⡕⡕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⢕⠅⢀⢔⢜⢜⢜⢜⢜⢜⠄\r\n"
							+ "⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⡸⠘⠀⡰⡸⡸⡸⡸⡸⡸⡸⡸⢄\r\n" + "⢜⢜⢜⢜⢜⢌⢎⠎⢎⢎⢎⢎⢎⢎⢎⢎⢎⠎⠂⢠⢪⢪⠪⡪⡪⡪⡪⡪⡪⡪⡪\r\n"
							+ "⢕⢕⢕⢕⢕⢕⢕⢄⡀⠑⢱⢱⢱⢑⢕⠕⠁⢀⢜⢜⢜⢜⢜⢜⢜⢌⢎⢎⢪⢪⢪\r\n" + "⠸⡸⡸⡸⡰⡱⡱⡱⡸⡄⡄⠈⠊⡎⠎⠀⡔⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡕⡅\r\n"
							+ "⠈⢎⢎⢎⢎⢎⢎⢎⢎⢎⢎⢖⢄⢀⢠⢪⢪⢪⢪⢪⢪⢪⠪⡪⡪⡪⡪⡪⡪⡪⠂\r\n" + "⠀⠘⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⡜⠌⠀\r\n"
							+ "⠀⠀⠈⢎⢎⢪⢪⠪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⡪⠂⠀⠀\r\n" + "⠀⠀⠀⠀⠣⡣⡣⡣⡣⡣⡪⡪⡪⡪⢪⠪⡪⡪⡪⡪⡪⢪⢊⢎⢎⢪⠊⠀⠀⠀⠀\r\n"
							+ "⠀⠀⠀⠀⠀⠀⠑⠕⡕⡕⡕⡕⡕⡪⡱⡱⡱⡱⡱⡸⡸⡸⡸⡸⠘⠀⠀⠀⠀⠀⠀\r\n" + "⠀⠀⠀⠀⠀⠀⠀⠀⠈⠈⠊⠎⠎⡎⡎⡎⡎⡎⠎⠎⠊⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀");
					System.out.println("회원 등록 성공");
				} else {
					System.out.println("⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⡄⡆⡖⣜⢜⢜⢜⣒⢖⢔⢄⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n" + "⠀⠀⠀⠀⠀⢀⢠⢢⡣⣣⢣⢳⢱⡱⡱⡹⡸⡸⡸⡸⡪⡪⡣⡣⡄⡀⠀⠀⠀⠀⠀\r\n"
							+ "⠀⠀⠀⢀⢰⢸⡸⡱⡱⡱⡱⡕⣕⢕⢝⢜⢕⢝⢜⢎⢮⢺⢸⢪⢪⡪⡢⠀⠀⠀⠀\r\n" + "⠀⠀⢀⢎⢎⢇⢇⢧⢓⢝⢜⢜⡜⡜⡎⡇⡧⡳⡱⡕⣕⢕⡕⡵⡱⡱⡍⡧⡀⠀⠀\r\n"
							+ "⠀⢠⢣⢳⢱⢕⢵⢱⢕⢝⠜⡕⡕⣕⢵⢱⡱⡱⣱⢱⠱⡱⡱⡱⡕⡵⡱⡱⡍⡆⠀\r\n" + "⢀⢇⢧⢳⢱⡱⡕⡕⣕⠅⠀⠀⠑⢕⢕⢕⢕⢝⠌⠀⠀⢘⢜⢕⢕⢕⢵⢱⢕⢕⠄\r\n"
							+ "⢔⢕⡕⣕⢕⢕⢕⢝⢔⢝⢤⠀⠀⠈⠘⡕⠕⠁⠀⢀⢔⢝⢜⢕⢝⢜⢼⢸⢜⡪⡅\r\n" + "⢇⢧⢣⢣⡣⡳⡱⡣⡫⡪⡪⡣⣅⡀⠀⠀⠀⢀⢔⢕⢕⢕⢇⢗⢕⢇⢧⢣⢣⢣⢣\r\n"
							+ "⢪⢎⢎⢇⢇⢧⢳⢱⢹⢸⢱⡱⠑⠀⠀⠀⠀⠀⠣⡣⡫⡪⡎⡮⡪⡎⡮⡪⡣⡳⡱\r\n" + "⢑⢕⢵⢱⢣⢣⡣⡣⡳⡱⡑⠀⠀⢀⢔⢕⢆⠀⠀⠀⠹⡸⡸⡜⣜⢜⢜⢜⢎⢮⠊\r\n"
							+ "⠈⢮⢪⢎⢎⢇⢇⢏⢎⠆⠀⠀⡔⡕⣕⢕⢇⠯⡄⡀⠀⢨⡪⡪⡪⡪⡣⡳⡱⡕⠁\r\n" + "⠀⠘⡜⡜⡎⡎⡇⡧⡳⡹⡸⡸⡜⡎⡎⣎⢎⢇⢇⡇⡧⡣⡣⡫⡪⡣⡳⡱⡕⠅⠀\r\n"
							+ "⠀⠀⠘⢜⢎⢞⢜⡜⣜⢜⢎⢮⢪⡪⣪⢪⡪⡣⡣⣣⢣⢳⢹⢸⢪⢺⢸⠜⠈⠀⠀\r\n" + "⠀⠀⠀⠀⠣⢣⡣⡣⡣⣣⢣⡣⡣⡣⡣⡣⡣⡳⡹⡸⡸⡜⣜⢼⢸⢜⠜⠀⠀⠀⠀\r\n"
							+ "⠀⠀⠀⠀⠀⠀⠑⠝⡜⣜⢜⢜⢎⢇⢏⢎⢇⢇⢧⢣⡣⣣⢣⠣⠃⠀⠀⠀⠀⠀⠀\r\n" + "⠀⠀⠀⠀⠀⠀⠀⠀⠈⠈⠊⠣⠣⡳⡱⡕⡇⡏⠎⠎⠊⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀");
					System.out.println("회원 등록 실패");
				}

			} else if (menu == 2) {
				
				System.out.println("=====로그인=====");
				System.out.print("ID 입력 : ");
				String id = sc.next();
				System.out.print("PW 입력 : ");
				String pw = sc.next();

//				한번에 로그인 하려면 새로운 메소드를 하나 묶어서 만들면 됨
//				new MemberDTO(id, pw);

				DeveloperDTO info = controller.login(id, pw);

				if (info != null) {
					System.out.println(info.getId() + "님 환영합니다.");
					break;
				} else {
					System.out.println("정확한 정보를 입력해주세요.");

				}
			} else if (menu == 3) {

				System.out.println("====회원탈퇴====");
				System.out.print("삭제할 아이디를 입력해주세요 : ");
				String id = sc.next();
				int cnt = controller.delete(id);

				if (cnt > 0) {
					System.out.println("탈퇴성공");
				} else {
					System.out.println("탈퇴실패");

				}
			}
		}

		while (true) {
			System.out.println("=======1.게임시작======");
			System.out.println("=======2.랭킹확인======");
			System.out.println("=======3.캐릭터 삭제======");
			int menu = sc.nextInt();

			// 1. 게임시작
			if (menu == 1) {
				break;
			}
			// 2. 랭킹

			else if (menu == 2) {
				System.out.println("====랭킹 조회====");

				ArrayList<String> list = controller.CharacterList();// 나중에 characterDTO로 변경

				System.out.println("닉네임\t 연봉");
				for (int i = 0; i < list.size(); i++) {
					System.out.print(list.get(i) + "\t");
				}
				System.out.println();
				System.out.println();
			}
			// 3 . 캐릭터 삭제
			else if (menu == 3) {
				System.out.println("====캐릭터 삭제=====");
				System.out.print("삭제할 닉네임을 입력해주세요 : ");
				String name = sc.next();
				int cnt = controller.cDelete(name);

				if (cnt > 0) {
					System.out.println("삭제 성공");
				} else {
					System.out.println("삭제 실패");

				}
			}

		}
		// 캐릭터 생성 및 능력치 분배

		System.out.println("캐릭터를 생성합니다.");
		System.out.print("이름을 입력해주세요 :");
		String name = sc.next();
		System.out.println("능력치를 분배해주세요");
		System.out.println("1.체력 2.지능 3.신앙력 4.마력 5.정신력");
		System.out.print("체력 : ");
		int health = sc.nextInt();
		System.out.print("지능 : ");
		int intelligence = sc.nextInt();
		System.out.print("신앙력 : ");
		int faithPower = sc.nextInt();
		System.out.print("마력 : ");
		int magicPower = sc.nextInt();
		System.out.print("정신력 : ");
		int mentality = sc.nextInt();
		int salary = 0;
		
		player = new CharacterDTO(name, health, intelligence, faithPower, magicPower, mentality, salary);
		// CharacterDTO 만들어지면 컨트롤러에 입력해서 받아오면 됨

		// 배틀 시스템

		// 적의 스텟 설정
		for (int level = 1; level <= 3 && player.getHp() > 0; level++) {
			System.out.println("\nLevel " + level + " 적이 등장했습니다."); // 상대 스텟 분배
			if (level == 1) {
				int hp = 300;
				int intell = 40;
				int fp = 40;
				int mp = 40;
				int ment = 40;
				enemy = new CharacterDTO("pbk mk1", level, hp, intell, fp, mp, ment);
			} else if (level == 2) {
				int hp = 450;
				int intell = 55;
				int fp = 20;
				int mp = 55;
				int ment = 30;
				enemy = new CharacterDTO("pbk mk2", level, hp, intell, fp, mp, ment);
			} else if (level == 3) {
				int hp = 500;
				int intell = 60;
				int fp = 20;
				int mp = 60;
				int ment = 45;
				enemy = new CharacterDTO("pbk mk3", level, hp, intell, fp, mp, ment);
			}
			// 적의 공격행동 설정
			while (player.getHp() > 0 && enemy.getHp() > 0) {
				Random rand = new Random();
				int enemyAttackType = rand.nextInt(3) + 1;
				int playerAttack = 0;
				int enemyAttack = 0;
				if (enemyAttackType == 1) {
					enemyAttack = enemy.normalAttack();
					if (enemyAttack > 0) {
						System.out.println(enemy.getName() + "가 일반 공격을 할 것 같습니다. 예상 수치: " + Math.abs(enemyAttack));
					} else {
						System.out.println("상대 공격을 피할 수 있을것 같습니다.");
					}
				} else if (enemyAttackType == 2) {
					enemyAttack = enemy.specialAttack();
					if (enemyAttack > 0) {
						System.out.println(enemy.getName() + "가 특수 공격을 할 것 같습니다. 예상 수치: " + Math.abs(enemyAttack));
					} else {
						System.out.println("상대 공격을 피할 수 있을것 같습니다.");
					}

				} else if (enemyAttackType == 3) {
					enemy.setHp(enemy.getHp() + enemy.defend());
					System.out
							.println(enemy.getName() + "가 방어를 시전하여 " + enemy.defend() + " 만큼 충격을 상쇄하고 남은 수치만큼 회복 합니다.");
				}
				// 플레이어의 공격 선택
				System.out.print("\n1. 일반 공격 2. 특수 공격 3. 방어 선택: ");
				int actionChoice = sc.nextInt();
				if (actionChoice == 1) {
					playerAttack = player.normalAttack();
					if (playerAttack > 0) {
						System.out.println(player.getName() + "가 일반 공격을 하여 " + playerAttack + "데미지를 입혔습니다.");
					} else {
						System.out.println("공격이 빗나갔습니다.");
					}
				} else if (actionChoice == 2) {
					playerAttack = player.specialAttack();
					if (playerAttack > 0) {
						System.out.println(player.getName() + "가 특수 공격을 하여 " + playerAttack + "데미지를 입혔습니다.");
					} else {
						System.out.println("공격이 빗나갔습니다.");
					}
				} else if (actionChoice == 3) {
					enemy.setHp(enemy.getHp() + player.defend());
					System.out.println(
							player.getName() + "가 방어를 시전하여 " + player.defend() + " 만큼 충격을 상쇄하고 남은 수치만큼 회복 합니다.");
				}
				// 플레이어의 공격
				enemy.setHp(enemy.getHp() - playerAttack);
				if (enemy.getHp() <= 0) {
					System.out.println("\n" + enemy.getName() + "가 패배하였습니다. " + enemy.getHp());
					break;
				}
				// 적의 공격
				player.setHp(player.getHp() - enemyAttack);
				if (player.getHp() <= 0) {
					System.out.println("\n" + player.getName() + "가 패배하였습니다. " + player.getHp());
					break;
				}
				// 남은 체력 출력
				System.out.println("\n" + player.getName() + "의 체력: " + player.getHp() + ", " + enemy.getName()
						+ "의 체력: " + enemy.getHp());
			}
			// 승리

		}
		if (player.getHp() > 0) {
			System.out.println("\n축하합니다! 모든 적을 이기고 게임에서 승리하였습니다!");
			System.out.println("랭킹에 등록합니다");
			player.setSalary(player.getHp());
			System.err.println("당신의 연봉은" + player.getSalary() * 100 + "만원 입니다");
			int cnt = controller.inputStats(player);
			if (cnt > 0) {
				System.out.println("랭킹 등록이 완료되었습니다");
			} else {
				System.out.println("랭킹 등록에 실패했습니다");
			}
		}
	}
}
// 배틀 시스템
